; domain
(define (domain pacman)

(:requirements :strips :disjunctive-preconditions :typing :conditional-effects :negative-preconditions)

(:types 
    posicao
)


(:predicates
    ; Predicados de Localização
    (pacman-em ?px ?py - posicao)
    (fantasmaR-em ?px ?py - posicao)
    (fantasmaG-em ?px ?py - posicao)
    (fantasmaB-em ?px ?py - posicao)
    (frutaR-em ?px ?py - posicao)
    (frutaG-em ?px ?py - posicao)
    (frutaB-em ?px ?py - posicao)
    (parede-em ?px ?py - posicao)

    ; Predicados de liberação
    (pacman-liberado)
    (fantasmaR-liberado)
    (fantasmaG-liberado)
    (fantasmaB-liberado)

    ; Predicados de Direção do Fantasma Azul:
    (fantasmaB-up)
    (fantasmaB-right)
    (fantasmaB-down)
    (fantasmaB-left)

    ; Predicados de Direção do Fantasma Verde:
    (fantasmaG-up)
    (fantasmaG-right)
    (fantasmaG-down)
    (fantasmaG-left)

    ; Predicados de Direção do Fantasma Vermelho:
    (fantasmaR-up)
    (fantasmaR-right)
    (fantasmaR-down)
    (fantasmaR-left)

    ; Predicados de Checagem de Morte:
    (checar-morto-pre)
    (checar-morto-pos)
    

    ; Predicados de Incremento/Decremento:
    (inc ?x ?xn)
    (dec ?x ?xn)

    ; Predicados frutas:
    (frutaR-ativa)
    (frutaG-ativa)
    (frutaB-ativa)

    ; Predicados de finalização
    (fantasmaR-morto)
    (fantasmaG-morto)
    (fantasmaB-morto)
    (pacman-morto)
)



        (:action checagem-morto-pre
    :parameters (?px ?py - posicao)
    :precondition (and (checar-morto-pre) (pacman-em ?px ?py))
    :effect (and
        (when
            (or
                (and (pacman-em ?px ?py) (fantasmaR-em ?px ?py))
                (and (pacman-em ?px ?py) (fantasmaG-em ?px ?py))
                (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py))
            )
            (pacman-morto)
        )
        (not(checar-morto-pre))
        (fantasmaR-liberado)
    
    )
)


    (:action checagem-morto-pos
        :parameters (?px ?py - posicao)
        :precondition (and (checar-morto-pos) (pacman-em ?px ?py))
        :effect (and
            (when
                (or
                    (and (pacman-em ?px ?py) (fantasmaR-em ?px ?py))
                    (and (pacman-em ?px ?py) (fantasmaG-em ?px ?py))
                    (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py))
                )
                (pacman-morto)
            )
            (not(checar-morto-pos))
            (pacman-liberado)
        )
    )



    (:action move-pacman-up
    :parameters (?x ?y ?yn - posicao)
    :precondition (and (pacman-liberado) (pacman-em ?x ?y) (dec ?y ?yn))
    :effect (and
        (when
            (and
                (not(parede-em ?x ?yn))
            )

            (and
                (not (pacman-em ?x ?y))
                (not(pacman-liberado))

                (pacman-em ?x ?yn)
                (fantasmaG-up)
                (fantasmaB-down)
                (checar-morto-pre)
            )
        )
    )
)


    (:action move-pacman-down
    :parameters (?x ?y ?yn - posicao)
    :precondition (and (pacman-liberado) (pacman-em ?x ?y) (inc ?y ?yn))
    :effect (and
        (when
            (and
                (not(parede-em ?x ?yn))
            )

            (and
                (not (pacman-em ?x ?y))
                (not(pacman-liberado))

                (pacman-em ?x ?yn)
                (fantasmaB-up)
                (fantasmaG-down)
                (checar-morto-pre)
            )
        )
    )
)

   
    (:action move-pacman-left
    :parameters (?x ?y ?xn - posicao)
    :precondition (and (pacman-liberado) (pacman-em ?x ?y) (dec ?x ?xn))
    :effect (and
        (when
            (and
                (not(parede-em ?xn ?y))
            )

            (and
                (not(pacman-em ?x ?y))
                (not(pacman-liberado))

                (pacman-em ?xn ?y)
                (fantasmaB-right)
                (fantasmaG-left)
                (checar-morto-pre)
            )
        )
    )
)


    (:action move-pacman-right
    :parameters (?x ?y ?xn - posicao)
    :precondition (and (pacman-liberado) (pacman-em ?x ?y) (inc ?x ?xn))
    :effect (and
        (when
            (and
                (not(parede-em ?xn ?y))
            )

            (and
                (not(pacman-em ?x ?y))
                (not(pacman-liberado))

                (pacman-em ?xn ?y)
                (fantasmaB-left)
                (fantasmaG-right)
                (checar-morto-pre)
            )
        )
    )
)



    (:action move-fantasmaR-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaR-em ?x ?y) (not(fantasmaR-morto)) (fantasmaR-liberado) (fantasmaR-up) (dec ?y ?yn))
        :effect (and
            (when
                (not(parede-em ?x ?yn))
                (and
                    (not(fantasmaR-em ?x ?y))
                    (fantasmaR-em ?x ?yn)
                    (not(fantasmaR-liberado))
                    (checar-morto-pos)
                )
            )
            (when
                (parede-em ?x ?yn)
                (and
                    (not(fantasmaR-up))
                    (fantasmaR-right)
                )
            )
        )
    )


(:action move-fantasmaR-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaR-em ?x ?y) (fantasmaR-liberado) (not(fantasmaR-morto)) (fantasmaR-down) (inc ?y ?yn) )
        :effect (and
            (when
                (not(parede-em ?x ?yn))
                (and
                    (not(fantasmaR-em ?x ?y))
                    (fantasmaR-em ?x ?yn)
                    (not(fantasmaR-liberado))
                    (checar-morto-pos)
                )
            )
            (when
                (parede-em ?x ?yn)
                (and
                    (not(fantasmaR-down))
                    (fantasmaR-left)
                )
            )
        )
    )


    (:action move-fantasmaR-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaR-em ?x ?y) (fantasmaR-liberado) (not(fantasmaR-morto)) (fantasmaR-left) (dec ?x ?xn))
        :effect (and
            (when
                (not(parede-em ?xn ?y))
                (and
                    (not(fantasmaR-em ?x ?y))
                    (fantasmaR-em ?xn ?y)
                    (not(fantasmaR-liberado))
                    (checar-morto-pos)
                )
            )
            (when
                (parede-em ?xn ?y)
                (and
                    (not(fantasmaR-left))
                    (fantasmaR-up)
                )
            )
        )
    )


    (:action move-fantasmaR-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaR-em ?x ?y) (fantasmaR-liberado) (not(fantasmaR-morto)) (fantasmaR-right) (inc ?x ?xn))
        :effect (and
            (when
                (not(parede-em ?xn ?y))
                (and
                    (not(fantasmaR-em ?x ?y))
                    (fantasmaR-em ?xn ?y)
                    (not(fantasmaR-liberado))
                    (checar-morto-pos)
                )
            )
            (when
                (parede-em ?xn ?y)
                (and
                    (not(fantasmaR-right))
                    (fantasmaR-down)
                )
            )
        )
    )



    (:action comer-fruta-red
        :parameters (?px ?py - posicao)
        :precondition (and (pacman-em ?px ?py) (frutaR-em ?px ?py) (not(frutaG-ativa)) (not(frutaB-ativa)))
        :effect (and
        (not(frutaR-em ?px ?py))
        (frutaR-ativa))
    )


    (:action comer-fantasma-red
        :parameters (?px ?py - posicao)
        :precondition (and (pacman-em ?px ?py) (not(fantasmaR-morto)) (fantasmaR-em ?px ?py) (frutaR-ativa))
        :effect (and (fantasmaR-morto) (not(frutaR-ativa)))
    )



    (:action move-fantasmaB-up
    :parameters (?x ?y ?yn - posicao)
    :precondition (and (fantasmaB-em ?x ?y) (fantasmaB-liberado) (not(fantasmaB-morto)) (fantasmaB-up) (dec ?y ?yn))
    :effect (and
        (when
            (and
                (not(parede-em ?x ?yn))
            )

            (and
                (not(fantasmaB-em ?x ?y))
                (fantasmaB-em ?x ?yn)

                (not(fantasmaB-liberado))
                (not(fantasmaB-up))
                (checar-morto-pos)
                
            )
        )
        (when (and (parede-em ?x ?yn)) 
            (and (not(fantasmaB-liberado)) (not(fantasmaB-up)) (checar-morto-pos))
        )
    )
)


    (:action move-fantasmaB-down
    :parameters (?x ?y ?yn - posicao)
    :precondition (and (fantasmaB-em ?x ?y) (fantasmaB-liberado) (not(fantasmaB-morto)) (fantasmaB-down) (inc ?y ?yn))
    :effect (and
        (when
            (and
                (not(parede-em ?x ?yn))
            )

            (and
                (not(fantasmaB-em ?x ?y))
                (fantasmaB-em ?x ?yn)
                (not(fantasmaB-liberado))
                (not(fantasmaB-down))
                (checar-morto-pos)
                
            )
        )
        (when (and (parede-em ?x ?yn)) 
            (and (not(fantasmaB-liberado)) (not(fantasmaB-down)) (checar-morto-pos))
        )
    )
)


    (:action move-fantasmaB-left
    :parameters (?x ?y ?xn - posicao)
    :precondition (and (fantasmaB-em ?x ?y) (fantasmaB-liberado) (not(fantasmaB-morto)) (fantasmaB-left) (dec ?x ?xn))
    :effect (and
        (when
            (and
                (not(parede-em ?xn ?y))
            )

            (and
                (not(fantasmaB-em ?x ?y))
                (fantasmaB-em ?xn ?y)
                (not(fantasmaB-liberado))
                (not(fantasmaB-left))
                (checar-morto-pos)
                
            )
        )
        (when (and (parede-em ?xn ?y)) 
            (and (not(fantasmaB-liberado)) (not(fantasmaB-left)) (checar-morto-pos))
        )
    )
)


    (:action move-fantasmaB-right
    :parameters (?x ?y ?xn - posicao)
    :precondition (and (fantasmaB-em ?x ?y) (fantasmaB-liberado) (not(fantasmaB-morto)) (fantasmaB-right) (inc ?x ?xn))
    :effect (and
        (when
            (and
                (not(parede-em ?xn ?y))
            )

            (and
                (not(fantasmaB-em ?x ?y))
                (fantasmaB-em ?xn ?y)
                (not(fantasmaB-liberado))
                (not(fantasmaB-right))
                (checar-morto-pos)
                
            )
        )
        (when (and (parede-em ?xn ?y)) 
            (and (not(fantasmaB-liberado)) (not(fantasmaB-right)) (checar-morto-pos))
        )
    )
)



    (:action comer-fruta-Blue
    :parameters (?px ?py - posicao)
    :precondition (and (pacman-em ?px ?py) (frutaB-em ?px ?py) (not(frutaR-ativa)) (not(frutaG-ativa)))
    :effect (and
    (not(frutaB-em ?px ?py))
    (frutaB-ativa))
    )


    (:action comer-fantasma-Blue
    :parameters (?px ?py - posicao)
    :precondition (and (pacman-em ?px ?py) (fantasmaB-em ?px ?py) (frutaB-ativa))
    :effect (and (fantasmaB-morto) (not(frutaB-ativa)))
    )

)

; problem
(define (problem pacmanCOMPETICAOTOP)
        (:domain pacman)
        (:objects
        x1 x2 x3 x4 x5 y1 y2 y3 y4 y5 - posicao
		)
    (:init
    (pacman-liberado)
		(parede-em x1 y1)
		(fantasmaR-right)
		(parede-em x1 y2)
		(fantasmaR-right)
		(parede-em x1 y3)
		(fantasmaR-right)
		(parede-em x1 y4)
		(fantasmaR-right)
		(parede-em x1 y5)
		(fantasmaR-right)
		(parede-em x2 y1)
		(fantasmaR-right)
		(pacman-em x2 y2)
		(fantasmaR-right)
		(fantasmaR-right)
		(fantasmaR-right)
		(parede-em x2 y5)
		(fantasmaR-right)
		(parede-em x3 y1)
		(fantasmaR-right)
		(fantasmaR-right)
		(frutaR-em x3 y3)
		(fantasmaR-right)
		(fantasmaR-right)
		(parede-em x3 y5)
		(fantasmaR-right)
		(parede-em x4 y1)
		(fantasmaR-right)
		(fantasmaR-right)
		(fantasmaR-right)
		(fantasmaR-em x4 y4)
		(fantasmaR-right)
		(parede-em x4 y5)
		(fantasmaR-right)
		(parede-em x5 y1)
		(fantasmaR-right)
		(parede-em x5 y2)
		(fantasmaR-right)
		(parede-em x5 y3)
		(fantasmaR-right)
		(parede-em x5 y4)
		(fantasmaR-right)
		(parede-em x5 y5)
		(fantasmaR-right)
		(inc x1 x2)
		(inc x2 x3)
		(inc x3 x4)
		(inc x4 x5)
		(inc y1 y2)
		(inc y2 y3)
		(inc y3 y4)
		(inc y4 y5)
		(dec x2 x1)
		(dec x3 x2)
		(dec x4 x3)
		(dec x5 x4)
		(dec y2 y1)
		(dec y3 y2)
		(dec y4 y3)
		(dec y5 y4)
)
    (:goal
        (and
            (not(pacman-morto))
			(fantasmaR-morto))))

; plan
1. (move-pacman-right x2 y2 x3)
   deleted: (pacman-em x2 y2) (pacman-liberado)
   added: (pacman-em x3 y2) (fantasmab-left) (fantasmag-right) (checar-morto-pre)
   goals met: 1 of 2
2. (checagem-morto-pre x3 y2)
   deleted: (checar-morto-pre)
   added: (fantasmar-liberado)
   goals met: 1 of 2
3. (move-fantasmar-right x4 y4 x5)
   deleted: (fantasmar-right)
   added: (fantasmar-down)
   goals met: 1 of 2
4. (move-fantasmar-down x4 y4 y5)
   deleted: (fantasmar-down)
   added: (fantasmar-left)
   goals met: 1 of 2
5. (move-fantasmar-left x4 y4 x3)
   deleted: (fantasmar-em x4 y4) (fantasmar-liberado)
   added: (fantasmar-em x3 y4) (checar-morto-pos)
   goals met: 1 of 2
6. (checagem-morto-pos x3 y2)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 2
7. (move-pacman-down x3 y2 y3)
   deleted: (pacman-em x3 y2) (pacman-liberado)
   added: (pacman-em x3 y3) (fantasmab-up) (fantasmag-down) (checar-morto-pre)
   goals met: 1 of 2
8. (comer-fruta-red x3 y3)
   deleted: (frutar-em x3 y3)
   added: (frutar-ativa)
   goals met: 1 of 2
9. (checagem-morto-pre x3 y3)
   deleted: (checar-morto-pre)
   added: (fantasmar-liberado)
   goals met: 1 of 2
10. (move-fantasmar-left x3 y4 x2)
   deleted: (fantasmar-em x3 y4) (fantasmar-liberado)
   added: (fantasmar-em x2 y4) (checar-morto-pos)
   goals met: 1 of 2
11. (checagem-morto-pos x3 y3)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 2
12. (move-pacman-left x3 y3 x2)
   deleted: (pacman-em x3 y3) (pacman-liberado)
   added: (pacman-em x2 y3) (fantasmab-right) (fantasmag-left) (checar-morto-pre)
   goals met: 1 of 2
13. (checagem-morto-pre x2 y3)
   deleted: (checar-morto-pre)
   added: (fantasmar-liberado)
   goals met: 1 of 2
14. (move-fantasmar-left x2 y4 x1)
   deleted: (fantasmar-left)
   added: (fantasmar-up)
   goals met: 1 of 2
15. (move-fantasmar-up x2 y4 y3)
   deleted: (fantasmar-em x2 y4) (fantasmar-liberado)
   added: (fantasmar-em x2 y3) (checar-morto-pos)
   goals met: 1 of 2
16. (comer-fantasma-red x2 y3)
   deleted: (frutar-ativa)
   added: (fantasmar-morto)
   goals met: 2 of 2
